turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N2B.atdf
        <register caption="System Clock Status Register" name="PMC_SCSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Programmable Clock 0 Output Status" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Status" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Status" mask="0x00000400" name="PCK2"/>
        </register>
        <register caption="Peripheral Clock Enable Register 0" name="PMC_PCER0" offset="0x0010" rw="W" size="4">
          <bitfield caption="Peripheral Clock 9 Enable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Enable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Enable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Enable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Enable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Enable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Enable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 19 Enable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Enable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Enable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 23 Enable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Enable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Enable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Enable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Enable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Enable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Enable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Enable" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Enable" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Peripheral Clock Disable Register 0" name="PMC_PCDR0" offset="0x0014" rw="W" size="4">
          <bitfield caption="Peripheral Clock 9 Disable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Disable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Disable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Disable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Disable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Disable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Disable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 19 Disable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Disable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Disable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 23 Disable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Disable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Disable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Disable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Disable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Disable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Disable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Disable" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Disable" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Peripheral Clock Status Register 0" name="PMC_PCSR0" offset="0x0018" rw="R" size="4">
          <bitfield caption="Peripheral Clock 9 Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 19 Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 23 Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Status" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 30 Status" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral Clock 31 Status" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Main Oscillator Register" name="CKGR_MOR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Main Crystal Oscillator Enable" mask="0x00000001" name="MOSCXTEN"/>
          <bitfield caption="Main Crystal Oscillator Bypass" mask="0x00000002" name="MOSCXTBY"/>
          <bitfield caption="Main On-Chip RC Oscillator Enable" mask="0x00000008" name="MOSCRCEN"/>
          <bitfield caption="Main On-Chip RC Oscillator Frequency Selection" mask="0x00000070" name="MOSCRCF" values="CKGR_MOR__MOSCRCF"/>
          <bitfield caption="Main Crystal Oscillator Start-up Time" mask="0x0000FF00" name="MOSCXTST"/>
          <bitfield caption="Password" mask="0x00FF0000" name="KEY"/>
          <bitfield caption="Main Oscillator Selection" mask="0x01000000" name="MOSCSEL"/>
          <bitfield caption="Clock Failure Detector Enable" mask="0x02000000" name="CFDEN"/>
        </register>
        <register caption="Main Clock Frequency Register" name="CKGR_MCFR" offset="0x0024" rw="R" size="4">
          <bitfield caption="Main Clock Frequency" mask="0x0000FFFF" name="MAINF"/>
          <bitfield caption="Main Clock Ready" mask="0x00010000" name="MAINFRDY"/>
        </register>
        <register caption="PLLA Register" name="CKGR_PLLAR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Divider" mask="0x000000FF" name="DIVA"/>
          <bitfield caption="PLLA Counter" mask="0x00003F00" name="PLLACOUNT"/>
          <bitfield caption="PLLA Multiplier" mask="0x07FF0000" name="MULA"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
        </register>
        <register caption="Master Clock Register" name="PMC_MCKR" offset="0x0030" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000003" name="CSS" values="PMC_MCKR__CSS"/>
          <bitfield caption="Processor Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_MCKR__PRES"/>
          <bitfield caption="PLLA Divisor by 2" mask="0x00001000" name="PLLADIV2"/>
        </register>
